---
type: DockablePaneId
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# DockablePaneId

`Autodesk.Revit.UI.DockablePaneId` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DockablePaneId | — | `public DockablePaneId ( Guid guid )` |